; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 56055 2 2 4 3 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph3 - mode
	image0 - mode
	thermograph2 - mode
	thermograph1 - mode
	GroundStation2 - direction
	Star0 - direction
	GroundStation1 - direction
	Star3 - direction
	Planet4 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph3)
	(supports instrument1 image0)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 spectrograph3)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star0)
	(supports instrument3 spectrograph3)
	(supports instrument3 thermograph1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
)
(:goal (and
	(have_image Star3 spectrograph3)
	(have_image Planet4 image0)
	(have_image Star5 thermograph1)
	(have_image Planet6 thermograph1)
	(have_image Phenomenon7 thermograph1)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (turn_to satellite1 star5 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star5)
   goals met: 0 of 5
4. (turn_to satellite0 star3 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star3)
   goals met: 0 of 5
5. (turn_to satellite0 star0 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star0)
   goals met: 0 of 5
6. (turn_to satellite1 groundstation1 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 5
7. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 5
8. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 0 of 5
9. (turn_to satellite0 planet4 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet4)
   goals met: 0 of 5
10. (turn_to satellite1 star5 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star5)
   goals met: 0 of 5
11. (take_image satellite0 planet4 instrument1 image0)
   added: (have_image planet4 image0)
   goals met: 1 of 5
12. (take_image satellite1 star5 instrument3 thermograph1)
   added: (have_image star5 thermograph1)
   goals met: 2 of 5
13. (turn_to satellite1 planet6 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet6)
   goals met: 2 of 5
14. (turn_to satellite0 star3 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star3)
   goals met: 2 of 5
15. (take_image satellite1 planet6 instrument3 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 3 of 5
16. (take_image satellite0 star3 instrument1 spectrograph3)
   added: (have_image star3 spectrograph3)
   goals met: 4 of 5
17. (turn_to satellite1 phenomenon7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon7)
   goals met: 4 of 5
18. (take_image satellite1 phenomenon7 instrument3 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   goals met: 5 of 5
